//***Lesson1
// Домашнее задание будет заиметь репозиторий на гитхабе с проектом 
//где будет первая ваша программа console.log("hello world!") если вы не сделали этого на уроке

console.log("Hello world!") 

//***Lesson2
//Создайте переменные 
//name, age, isStudent, height, hobby, favoriteNumber, isGraduated
//и присвойте им значения различных типов данных.

//Выведите в консоль типы всех этих переменных через запятую.

//Создайте переменные, содержащие явное undefined, неявное undefined и null, и выведите их типы в консоль через 
//||

//Создайте переменные для вашего года рождения и текущего года, а затем вычислите и выведите в консоль ваш текущий возраст. Формат вывода:

//Привет, мне {вычисленный возраст} лет.


//Задание со звёздочкой (использование Google и самостоятельное обучение)
//Выполните задание №4, используя конструктор 

//new Date()
//, чтобы ваш возраст всегда рассчитывался актуально, независимо от текущего года.


//Отправьте решение в виде ссылки на ваш удалённый репозиторий с домашним заданием.